OpenFOAM-4.x-master/tutorials/incompressible/pisoFoam/laminar/porousBlockage/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication blockMesh

runApplication topoSet

runApplication $application

#------------------------------------------------------------------------------
